In [1]:
import pandas as pd
import numpy as np

C:\Users\lenovo\Anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\lenovo\Anaconda3\lib\site-packages\numpy\.libs\libopenblas.EL2C6PLE4ZYW3ECEVIV3OXXGRN2NRFM2.gfortran-win_amd64.dll
C:\Users\lenovo\Anaconda3\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

In [2]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

C:\Users\lenovo\AppData\Local\Temp/ipykernel_26060/3279769219.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')

In [4]:
pd.__version__

'1.5.3'

To know the versions of pandas' dependencies, you can use the show_versions() function:

In [6]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.9.7.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22621
machine          : AMD64
processor        : Intel64 Family 6 Model 140 Stepping 1, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_India.1252

pandas           : 1.5.3
numpy            : 1.22.4
pytz             : 2021.3
dateutil         : 2.8.2
setuptools       : 58.0.4
pip              : 21.2.4
Cython           : 0.29.24
pytest           : 6.2.4
hypothesis       : None
sphinx           : 4.2.0
blosc            : None
feather          : None
xlsxwriter       : 3.0.1
lxml.etree       : 4.6.3
html5lib         : 1.1
pymysql          : 1.0.2
psycopg2         : None
jinja2           : 3.0.3
IPython          : 7.29.0
pandas_datareader: 0.10.0
bs4              : 4.10.0
bottleneck       : 1.3.2
brotli           :
fastparquet      : None
fsspec           : 2021.10.1
gcsfs            : None
matplotlib       : 3.6.0
numba            : None
numexpr          : 2.7.3
odfpy            : None
openpyxl         : 3.0.9
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.9.3
snappy           : None
sqlalchemy       : 1.4.40
tables           : 3.6.1
tabulate         : None
xarray           : 2023.1.0
xlrd             : 2.0.1
xlwt             : 1.3.0
zstandard        : None
tzdata           : None

#### Create an example dataframe

In [7]:
df= pd.DataFrame({'col one':[100,200], 'col two': [300,400]})
df

   col one  col two
0      100      300
1      200      400

In case we want to create a larger dataframe with random values then above menthod will become too tedious. In such cases we follow below trick.

In [9]:
df  = pd.DataFrame(np.random.rand(4,8)) # specify the no of rows & columns to be present in dataframe -  Here 4 rows 8 columns
df

,0,1,2,3,4,5,6,7
0,0.261714,0.242901,0.547267,0.371070,0.749469,0.829108,0.008813,0.208523
1,0.254259,0.280146,0.636097,0.948245,0.628606,0.423055,0.584245,0.997942
2,0.804274,0.586021,0.562087,0.003475,0.941246,0.649524,0.457182,0.150070
3,0.077864,0.263033,0.387939,0.091281,0.265779,0.359531,0.915441,0.011000

In [27]:
df  = pd.DataFrame(np.random.rand(6,10), columns=list('abcdefghij')) # specify the no of rows & columns to be present in dataframe - Here 6 rows 10 columns
df

,a,b,c,d,e,f,g,h,i,j
0,0.863357,0.080141,0.694713,0.874643,0.911720,0.636289,0.787398,0.505750,0.038158,0.714156
1,0.353779,0.515676,0.890467,0.119707,0.173114,0.497573,0.198461,0.760458,0.266689,0.455128
2,0.670871,0.851051,0.037246,0.080508,0.516448,0.991627,0.530695,0.173945,0.049936,0.426139
3,0.961722,0.030765,0.172545,0.637609,0.058397,0.996269,0.899915,0.964199,0.666498,0.027987
4,0.361856,0.478701,0.547781,0.060435,0.642253,0.996080,0.367924,0.642059,0.510970,0.380968
5,0.456991,0.037911,0.735867,0.822685,0.371626,0.957193,0.297072,0.658659,0.599958,0.585829

In [20]:
np.random.randint(0,10,54)

array([5, 7, 6, 5, 2, 6, 5, 3, 2, 8, 7, 7, 5, 0, 7, 9, 9, 1, 5, 4, 6, 2,
       8, 3, 7, 7, 9, 1, 9, 2, 8, 1, 3, 1, 4, 7, 9, 6, 5, 3, 2, 9, 8, 9,
       0, 6, 9, 0, 3, 0, 0, 8, 6, 2])

In [36]:
df  = pd.DataFrame(np.random.randint(1, 100, size=(6,10)) , columns=list('abcdefghij'))# specify the no of rows & columns to be present in dataframe - Here 6 rows 10 columns
df

    a   b   c   d   e   f   g   h   i   j
0  28  69  90   9  41  69  40  30  94  36
1  20  60  58  24  23  66   3  62  86  82
2  90  24  11  41  49  31  82  20  15  85
3  90  17  41  83  66  47  28  47  57  20
4  23   5  57  28   4  84  91  73  43   9
5   5  79  25  41  36  24  91   7  50  94

#### Rename Columns

In [49]:
df = pd.DataFrame({'col one':[100,200], 'col two':[300,400]})
df

   col one  col two
0      100      300
1      200      400

The most flexible method for renaming columns is the rename() method. You pass it a dictionary in which the keys are the old names and the values are the new names, and you also specify the axis:

In [53]:
df.rename({'col one': 'col_one', 'col two': 'col_two'}, axis='columns' )

   col_one  col_two
0      100      300
1      200      400

The best thing about this method is that you can use it to rename any number of columns, whether it be just one column or all columns.

Now if you're going to rename all of the columns at once, a simpler method is just to overwrite the columns attribute of the DataFrame:

In [54]:
df

   col one  col two
0      100      300
1      200      400

In [57]:
df.columns = ['col_one', 'col_two']
df

   col_one  col_two
0      100      300
1      200      400

In [60]:
df.columns = ['col one', 'col two']
df

   col one  col two
0      100      300
1      200      400

Now if the only thing you're doing is replacing spaces with underscores, an even better method is to use the str.replace() method, since you don't have to type out all of the column names:

In [61]:
df.columns = df.columns.str.replace(' ', '_')
df

   col_one  col_two
0      100      300
1      200      400

Finally, if you just need to add a prefix or suffix to all of your column names, you can use the add_prefix() method...

In [64]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [65]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

#### Reverse Row Order

In [68]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [71]:
drinks.loc[::-1].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

In [73]:
drinks.loc[::-1].reset_index().head()

,index,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,192,Zimbabwe,64,18,4,4.7,Africa
1,191,Zambia,32,19,4,2.5,Africa
2,190,Yemen,6,0,0,0.1,Asia
3,189,Vietnam,111,2,1,2.0,Asia
4,188,Venezuela,333,100,3,7.7,South America

In [76]:
drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

#### Reverse Column Order

In [77]:
drinks.loc[:, ::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

#### Select Columns by datatypes

In [78]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

Let's say you need to select only the numeric columns. You can use the select_dtypes() method:

In [80]:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

This includes both int and float columns.

You could also use this method to select just the object columns:

In [81]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

You can tell it to include multiple data types by passing a list:

In [87]:
drinks.select_dtypes(include= ['number', 'object', 'category', 'datetime'] )

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [88]:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

#### Convert strings to numbers

In [89]:
df = pd.DataFrame({'col_one': ['1.1','2.2','3.3'],
                  'col_two':  ['4.4', '5.5','6.6'],
                   'col_three': ['7.7','8.8','-']
                  })

In [90]:
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

These numbers are actually stored as strings, which results in object columns:

In [91]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In order to do mathematical operations on these columns, we need to convert the data types to numeric. You can use the astype() method on the first two columns:

In [92]:
df.astype({'col_one':'float','col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

However, this would have resulted in an error if you tried to use it on the third column, because that column contains a dash to represent zero and pandas doesn't understand how to handle it.

Instead, you can use the to_numeric() function on the third column and tell it to convert any invalid input into NaN values:

In [95]:
pd.to_numeric(df.col_three, errors='coerce') # this will fill the values which pandas cannot recognise as numeric with 'NaN'

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

If you know that the NaN values actually represent zeros, you can fill them with zeros using the fillna() method:

In [98]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0) # we can fill the NaN value with O as well , if we know that in the context of data NaN means 0

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [99]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [100]:
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [101]:
# We can also convert all the data types to numeric at once as below

df.apply(pd.to_numeric, errors='coerce').fillna(0)

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

#### Reduce DataFrame Size

Pandas DataFrames are designed to fit into memory, and so sometimes you need to reduce the DataFrame size in order to work with it on your system

In [102]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

You can see that it currently uses 30.4 KB.

If you're having performance problems with your DataFrame, or you can't even read it into memory, there are two easy steps you can take during the file reading process to reduce the DataFrame size.

The first step is to only read in the columns that you actually need, which we specify with the "usecols" parameter:

In [103]:
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

By only reading in these two columns, we've reduced the DataFrame size to 13.6 KB.

The second step is to convert any object columns containing categorical data to the category data type, which we specify with the "dtype" parameter:

In [104]:
dtypes = {'continent':'category'}
smaller_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols, dtype=dtypes)
smaller_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

By reading in the continent column as the category data type, we've further reduced the DataFrame size to 2.3 KB.

Keep in mind that the category data type will only reduce memory usage if you have a small number of categories relative to the number of rows.